#
# ! При створюванні проекту використовувалось
# *
# * (офіційна документація pygame)                   === https://www.pygame.org/docs/tut/newbieguide.html
# * (безкоштовні шрифти від google)                  === https://fonts.google.com/
# * (безкоштовний сервіс анімацій, картинкок, відео) === https://www.istockphoto.com/
# * (Приклади інших робіт з бібліотекою pygame)      === https://github.com/search?q=pygame
# *
# ! Гру створив MaKarastY
#

# ! ІМПОРТИ

from os.path import join    # ? з'єднує елементи
# ? імпортуєм функцію часу, яка вітдає системний час в секундах
from time import time

from random import choice

try:
    # * пайгейм
    import pygame
except:
    print(input('ПОМИЛКА ЗАВАНТАЖЕННЯ pygame'))  # ? головна бібліотека

# *  настройки
try:
    import налаштування as дата  # ? це данні типу кешу (змінювані під час гри)
except:
    print(input('ПОМИЛКА ЗАВАНТАЖЕННЯ НАЛАШТУВАНЬ'))

# * функції та деякі спрайти
try:
    # ? функції які безліч разів використовуються в коді
    from _ import функції
    # ? путлер та вибух (смерть)
    from _ import ворог
    # ? приціл, зброя та анімація пострілу
    from _ import зброя
except:
    print(input('ПОМИЛКА ЗАВАНТАЖЕННЯ ФУНКЦІЙ АБО СПРАЙТІВ'))

from os import listdir
from os.path import isfile, join

# ! ІНІЦІАЛІЗАЦІЯ Pygame
pygame.init()
pygame.font.init()

# ! ШРИФТИ
шрифт_м = pygame.font.Font(join(дата.папка_з_датою, 'LeelawUI.ttf'), 16)
шрифт_в = pygame.font.Font(join(дата.папка_з_датою, 'LeelawUI.ttf'), 30)

# ! ІГРОВЕ ВІКНО
Гра = функції.Ініціалізуватив_вікно_гри(
    дата.Гра_ширина,            # ? ширина
    дата.Гра_висота,            # ? висота
    pygame.FULLSCREEN,          # ? повноекранний режим
    (0, 0, 0),                  # ? колір фону
    "Putler killer II"          # ? назва вікна гри
)

# ! СПРАЙТИ
курсор_з_прицiлом = зброя.приціл()
Зброя = зброя.зброя()
Ворог = ворог.путлер()    # ? створення першого ворога

Спрайти = pygame.sprite.Group()
Спрайти_верх = pygame.sprite.Group()

Спрайти_верх.add(Зброя, курсор_з_прицiлом)
Спрайти.add(Ворог)

# ? Сховати системний курсор
pygame.mouse.set_cursor((8, 8), (0, 0), (0, 0, 0, 0, 0,
                        0, 0, 0), (0, 0, 0, 0, 0, 0, 0, 0))

# ! ЗМІННІ
Постріл = False       # ? чи відбувається постріл у даний момент
гра_робить = True     # ? чи працює ігровий цикл
назва_кімнати = 'меню'
color_i = 0
r, g, b = 0, 0, 0

# ! ЗВУКИ
Звук_постріл = функції.Завантаити_звук('звуки/shot.wav', 0.02)
Звук_немаєПатронів = функції.Завантаити_звук('звуки/empty.wav', 0.03)
Звук_перезарядка = функції.Завантаити_звук('звуки/reload.wav', 0.03)

# ! КАРТИНКИ ТА ФОН
фон = функції.Завантаити_фон()
Картинка_статусбар = pygame.image.load(
    join(дата.папка_з_датою, 'картинки/статусбар.png')
)
Картинка_лого = pygame.image.load(
    join(дата.папка_з_датою, 'картинки/лого.png')
)

# ! ФОНОВА ПІСНЯ
розташування = "_/звуки/музика/"
масив_пісні = [
    ф for ф in listdir(розташування) if isfile(join(розташування, ф))
]
функції.Завантаити_музику(f'звуки/музика/{choice(масив_пісні)}').play(-1)
pygame.mixer.music.set_volume(0.05)

# ! ДІЇ ПЕРЕД ЗАПУСКОМ ОСНОВНОЇ ЧАСТИНИ
функції.Генерація_зірок()

# ! ОСНОВНИЙ ЦИКЛ ГРИ
while гра_робить:

    # ? система бліку тексту
    дата.ii += 1
    if дата.ii % 50 == 0:
        дата.блік = not дата.блік

    # ? Обмеження частоти кадрів
    pygame.time.Clock().tick(дата.FPS)

    # ! ОБРОБНИК ПОДІЙ
    for ПОДІЇ in pygame.event.get():

        if ПОДІЇ.type == pygame.QUIT:
            гра_робить = False

        if ПОДІЇ.type == pygame.KEYDOWN:
            # ? ESC
            if ПОДІЇ.key == pygame.K_ESCAPE:
                дата.ініціалізація_гри = False
                if назва_кімнати == 'гра':
                    функції.clear()
                    Зброя.боєзапас = дата.Максимальний_боєзапас
                    Ворог.kill()
                    Ворог = ворог.путлер()
                    Спрайти.add(Ворог)
                    назва_кімнати = 'меню'
                else:
                    назва_кімнати = 'вихід'
                    гра_робить = False
            # ? ПРОБІЛ
            if ПОДІЇ.key == pygame.K_SPACE:
                if назва_кімнати == 'вихід':
                    функції.clear()
                    Зброя.боєзапас = дата.Максимальний_боєзапас
                    Ворог = ворог.путлер()
                    Спрайти.add(Ворог)
                    назва_кімнати = 'гра'

                if назва_кімнати == 'меню':
                    назва_кімнати = 'гра'

    # ? КНОПКИ МИШІ
    Миш_Кнопка_Ліва, _, Миш_Кнопка_Права = pygame.mouse.get_pressed()

    # ! КІМНАТА "МЕНЮ"
    if назва_кімнати == 'меню':
        Гра.blit(фон, (0, 0))
        функції.зірки(Гра)
        Гра.blit(Картинка_лого, (дата.СИСТЕМА_ширина / 4.5,
                 дата.СИСТЕМА_висота / 4.5))
        функції.меню(Гра, шрифт_в)
        pygame.display.update()

    # ! КІМНАТА "ГРА"
    if назва_кімнати == 'гра':

        if not дата.ініціалізація_гри:
            дата.ініціалізація_гри = True

        # ? якщо є патрони та натиснута ліва кнопка
        if Миш_Кнопка_Ліва and Зброя.боєзапас > 0:
            # ? якщо не йде безперервний постріл
            if Постріл is False:
                # ? перевірка зіткнення прицілу і путлера
                if pygame.sprite.collide_mask(Ворог, курсор_з_прицiлом):
                    Вибух = ворог.вибух()
                    Спрайти.add(Вибух)
                    дата.Ворог_k = [
                        дата.рахунок_ЗаВбивство * дата.рівень,
                        Вибух.rect.x,
                        Вибух.rect.y,
                        int(time())
                    ]
                    дата.Ворог_k_pos = 0
                    дата.Ворог_k_ = True
                    Ворог.kill()
                    Ворог = ворог.путлер()
                    Спрайти.add(Ворог)
                    дата.убийств += 1
                    if дата.убийств % дата.прокачувати_рівень_кожні == 0:
                        дата.рівень += 1
                    функції.Прорахувати_рахунок()

        # ! ПОСТРІЛ
        if Миш_Кнопка_Ліва and not Постріл:
            if Зброя.боєзапас > 0:
                Звук_постріл.play()
                Постріл = зброя.постріл()
                Спрайти.add(Постріл)
                дата.постріли += 1
                Зброя.боєзапас -= 1
            else:
                Звук_немаєПатронів.play()

        if Миш_Кнопка_Ліва:
            Постріл = True
        else:
            Постріл = False

        # ? Перезарядка (якщо немає патронів)
        if (not Миш_Кнопка_Ліва) and Миш_Кнопка_Права and Зброя.боєзапас == 0:
            Звук_перезарядка.play()
            Зброя.боєзапас = дата.Максимальний_боєзапас

        # ? Якщо путлер «утік» з поля зору
        if (Ворог.rect.x > дата.СИСТЕМА_ширина or
                Ворог.rect.y > дата.СИСТЕМА_висота or
                Ворог.rect.x < 1 - Ворог.Спрайт_розмір or
                Ворог.rect.y < 1 - Ворог.Спрайт_розмір):
            Ворог.kill()
            Ворог = ворог.путлер()
            Спрайти.add(Ворог)
            дата.пропущенні += 1
            if дата.пропущенні == дата.максимально_пропущенних:
                дата.ініціалізація_гри = False
                назва_кімнати = 'вихід'

        # ! Анімація напису KILL
        if дата.Ворог_k_:
            дата.Ворог_k_pos += 1

        # ? Видалити надпис, якщо час минув
        if дата.Ворог_k[3] + 1 < int(time()):
            дата.Ворог_k = [0, -200, -200, 0]
            дата.Ворог_k_pos = 0
            дата.Ворог_k_ = False

        # ! Оновлення спрайтів
        Спрайти.update()
        Спрайти_верх.update()

        # ! Рендер
        Гра.blit(фон, (0, 0))
        функції.зірки(Гра)
        функції.пулі(Гра, Зброя.боєзапас)
        функції.статусбар(Гра, Картинка_статусбар, шрифт_м)
        функції.убивство(Гра, шрифт_м,
                         дата.Ворог_k[0],
                         дата.Ворог_k[1],
                         дата.Ворог_k[2],
                         дата.Ворог_k[3])

        Спрайти.draw(Гра)
        Спрайти_верх.draw(Гра)

        pygame.display.update()

    # ! КІМНАТА «ВИХІД» (завершення гри)
    if назва_кімнати == 'вихід':
        if дата.ініціалізація_гри is False:
            Ворог.kill()
            дата.ініціалізація_гри = True

        Гра.blit(фон, (0, 0))
        функції.зірки(Гра)
        функції.гра_завершенна(Гра, шрифт_в, шрифт_м)
        pygame.display.update()

# ! Вихід
quit()
