#
# ! При створюванні проекту використовувалось
# *
# * (офіційна документація pygame)                   === https://www.pygame.org/docs/tut/newbieguide.html
# * (безкоштовні шрифти від google)                  === https://fonts.google.com/
# * (безкоштовний сервіс анімацій, картинкок, відео) === https://www.istockphoto.com/
# * (Приклади інших робіт з бібліотекою pygame)      === https://github.com/search?q=pygame
# *
# ! Гру створив MaKarastY
#

from os.path import split, join, abspath
# ? split повертає масив з головою та тілом шляху до файлу \ папки
# ? join з'єднує елементи
# ? abspatch повертає абсолютний шлях до файлу (C:\Users\...)

from ctypes import windll  # ? dll файли конкретно цього користувача

# ? знаходження масштабу екрана в windows
користувач     = windll.user32                  # ? dll файл конкретно цього користувача
СИСТЕМА_ширина = користувач.GetSystemMetrics(0) # ? ШИРИНА екрана з dll файлу
СИСТЕМА_висота = користувач.GetSystemMetrics(1) # ? ВИСОТА екрана з dll файлу


# ? ініціалізація та визначення папок
папка_з_грою  = split(abspath(__file__))[0] # ? папка в якій знаходься сама гра
папка_з_датою = join(папка_з_грою, '_')     # ? папка в якій знаходяться невід'ємні компоненти гри

# ? гра, а саме вікно гри
Гра_ширина    = 1366 # * Width  - ? ШИРИНА екрана
Гра_висота    = 768  # * Height - ? ВИСОТА екрана

# ? ініціалізація
ii = 0                        # ? Те що використовується для "живого тексту"
блік = False                  # ? Якщо = False текст не буде показуватись працює 1 раз в 50 % (false змінюеться на true і навпаки)
рівень = 1                    # ? 'рівень'   на початку гри ( Швидкість путлера = стартова швидкість + рівень )
убийств = 0                   # ? 'убийств'  на початку гри
рахунок = 0                   # ? 'рахунок'  на початку гри
постріли = 0                  # ? 'постріли' на початку гри

# ? Статистика
пропущенні = 0                # ? 'путлери яких ти пропустив' на початку гри
рахунок_ЗаВбивство = 2        # ? Скільки балів дати за вбивство путлера
максимально_пропущенних = 3  # ? Скільки максимально путлерів можна пропустити (не вбити)

# ? Рівні
прокачувати_рівень_кожні = 10 # ? кільки вбивств після яких ми повинні підвищити рівень

# ? напис kill після смерті путлера
Ворог_k                = [0, 0, 0, 0] # ? досяг за вбивство, х, у убитого ворога, час
Ворог_k_               = False
Ворог_k_pos            = 0

# ? Максимальний боєзапас
Максимальний_боєзапас = 10    # ? максимальний запас патронів в зброєї

# ? Зірки ( забавні білі крапочки на задньому фоні )
Масив_зiрки        = []       # ? масив в якому знаходяться кординати всіх зірок
Масив_зiрки_2      = []       # ? масив в якому знаходяться кординати всіх зірок
Максимально_зiрок  = 200      # ? максимальна довжина масиму отже і максимальна кількість зірок

# ? кадрів в секунду
FPS     = 144       # ? кадрів в секунду, зазвичай виставляють значіння FPS матриці монітору
хвилина = 60 * 60   # ? кількість кроків в хвилину

# ? Ініціалізація гри
ініціалізація_гри = False # ? чи запущенна гра в дданний момент