#
# ! При створюванні проекту використовувалось
# *
# * (офіційна документація pygame)                   === https://www.pygame.org/docs/tut/newbieguide.html
# * (безкоштовні шрифти від google)                  === https://fonts.google.com/
# * (безкоштовний сервіс анімацій, картинкок, відео) === https://www.istockphoto.com/
# * (Приклади інших робіт з бібліотекою pygame)      === https://github.com/search?q=pygame
# *
# ! Гру створив MaKarastY
#

import pygame # ? головна бібліотека
import налаштування as дата # ? функції які безліч разів використовуються в коді, закинув іх в інший файл щоб скоротити синтаксис

from os.path import join
# ? join з'єднує елементи
from random import randint
# ? randint Випадкова цифра віт - до 

# ! КОЛЬОРИ
white   = (255, 255, 255) # * білий
yellow  = (255, 255, 0)   # * жовтий
purple  = (255, 0, 255)   # * фіолетовий
orange  = (255, 200, 0)   # * помаранчевий
green   = (0, 255, 0)     # * зелений
blue    = (0, 0, 255)     # * синій
black   = (0, 0, 0)       # * чорний
red     = (255, 0, 0)     # * червоний

# ? ініціалізація вікна гри, точніше ми його створюємо


def Ініціалізуватив_вікно_гри(Вікно_ширина, Вікно_висота, весьЕкран, колір, підпис):
    вікно = pygame.display.set_mode((Вікно_ширина, Вікно_висота),весьЕкран )   # ? створити вікно з параметрами
    pygame.display.set_caption(підпис)  # ? підписати вікно
    # ? заповнити задній фон кольором, якщо недостатньо картинки фону
    вікно.fill(колір)
    return вікно

# ? Завантажити звук


def Завантаити_звук(НазваФайлу, гучність=1):
    звук = pygame.mixer.Sound( join( дата.папка_з_датою, НазваФайлу ))   # ? ініціалізувати звук в pygame
    звук.set_volume(гучність)   # ? задати звуку певну гучність
    return звук

# ? Завантажити музику


def Завантаити_музику(fileName):
    pygame.mixer.music.load( join( дата.папка_з_датою, fileName))  # ? ініціалізувати музику в pygame
    return pygame.mixer.music

# ? Завантажити фон


def Завантаити_фон():
    return pygame.transform.scale(pygame.image.load(join(дата.папка_з_датою, 'картинки/фон.jpg')),(дата.Гра_ширина,дата.Гра_висота) )# ? додає до сцени фон

# ? додає до сцени кількість патронів які залишились


def пулі(гра, боєзапас):
    for пуля in range(0, боєзапас):
       гра.blit(pygame.image.load( join(дата.папка_з_датою,'картинки/патрон.png' )), (дата.Гра_ширина - 32 - (пуля * 16), 16)) # ? додає до сцени пулі справа зверху

    if боєзапас == 0:
        гра.blit( pygame.image.load(join(дата.папка_з_датою,'картинки/перезарядка.png')),(дата.Гра_ширина - 510, - 20))# ? додає до сцени напис що потрібно перезарядитись

# ? Рендерить статусбар


def статусбар(гра, статусбар_картинка, шрифт):
    # ? додає до сцени  фон статус бара
    гра.blit(статусбар_картинка, (12, 12))

    # ?  додає до сцени швидкості (рівень)
    гра.blit(шрифт.render(str(
        # ? якщо рівень меньше 10 додає 0 щоб вишло 09
        (lambda A: '0' + str(A) if A < 10 else A)(дата.рівень)
    ), True, white), (184, 29))

    # ? додає до сцени  вбивства
    гра.blit(шрифт.render(str(дата.убийств),
             True, white), (78, 26))

    # ? додає до сцени пропущенні путлери
    гра.blit(шрифт.render(str(дата.пропущенні),
             True, white), (78, 63))

    # ? додає до сцени рахунок
    гра.blit(шрифт.render(str(дата.рахунок),
             True, white), (100, 95))

# ? Рендерити зірки


def зірки(гра):
    for зірка in дата.Масив_зiрки:
        pygame.draw.line(гра, white,
                         (зірка[0], зірка[1]), (зірка[0], зірка[1])
                         )    # ? x y
        зірка[0] = зірка[0] - 1  # ? рух зірки в бік
        if зірка[0] < 0:  # ? якщо зірка за екраном перерендерити з другого боку
            зірка[0] = дата.Гра_ширина
            зірка[1] = randint(0, дата.Гра_висота)
    for зірка in дата.Масив_зiрки_2:
        pygame.draw.line(гра, white,
                         (зірка[0], зірка[1]), (зірка[0], зірка[1])
                         )    # ? x y
        зірка[0] = зірка[0] - 2  # ? рух зірки в бік
        if зірка[0] < 0:    # ? якщо зірка за екраном перерендерити з другого боку
            зірка[0] = дата.Гра_ширина
            зірка[1] = randint(0, дата.Гра_висота)

# ? Рендерити повідомлення що 'натисни пробіл для старту'


def меню(гра, шрифт):
    if дата.блік:
        шрифт = шрифт.render('PRESS SPACE TO START THE GAME', True, white)
        гра.blit(шрифт, шрифт.get_rect(
            center=(дата.Гра_ширина / 2, дата.Гра_висота / 2 + 60)))# ? додає до повідомлення
        
# ? Рендерити завершення гри


def гра_завершенна(гра, шрифт_в, шрифт_м):
    if дата.блік:
        a = шрифт_в.render('PRESS SPACE TO RESTART THE GAME', True, white)
        гра.blit(a, a.get_rect(
            center=(дата.Гра_ширина / 2, дата.Гра_висота / 2 + 60)))# ? додає до повідомлення

    s = шрифт_в.render(f'You record {дата.рахунок}', True, white)
    гра.blit(s, s.get_rect(
        center=(дата.Гра_ширина / 2, дата.Гра_висота / 2)))# ? додає до повідомлення


# ? Рендерити повідомлення що ворог знищенний


def убивство(гра, шрифт, рахунок, x, y, час):
    шрифт = шрифт.render('KILL', True, white)
    гра.blit(шрифт, шрифт.get_rect(
        center=(x + 100, y + 100 - дата.Ворог_k_pos)))# ? додає до повідомлення

# ? Очистити бали та інше


def clear():
    дата.убийств = 0
    дата.рахунок = 0
    дата.постріли = 0
    дата.пропущенні = 0
    дата.рівень = 1
    дата.ініціалізація_гри = False

# ? Генерувння випадкових зірок


def Генерація_зірок():
    дата.Масив_зiрки = [  # ? генераємо зірки спереді
        # ? генераємо масив довжиною з максимальну суму зірок та вмістов випадкових позицій
        [randint(0, дата.Гра_ширина), randint(0, дата.Гра_висота)] for ф in range(дата.Максимально_зiрок)
    ]
    дата.Масив_зiрки_2 = [  # ? генераємо зірки ззаду
        # ? генераємо масив довжиною з максимальну суму зірок та вмістов випадкових позицій
        [randint(0, дата.Гра_ширина), randint(0, дата.Гра_висота)] for ф in range(дата.Максимально_зiрок)
    ]

# ? розрахунок рахунку на основі рівня та вбивств


def Прорахувати_рахунок(a=None):
    if a:
        дата.рахунок += a
    else:
        дата.рахунок += дата.рахунок_ЗаВбивство * дата.рівень
